import logo from "../../../assets/images/logo1.png";

export function Private_policy_section(props) {
    const {private_policy_section_data} = props;
    const private_policy_section_data_js = [
        {
            id_h1: 1111,
            private_policy_h1: "Общие положения",
            private_policy_container_h2: [
                {
                    id_h2: 1111164572,
                    private_policy_h2: "Настоящая Политика является неотъемлемой частью Пользовательского соглашения (далее — «Соглашение»), а также иных заключаемых с Пользователем договоров, когда это прямо предусмотрено их условиями. Таким образом, заключая Соглашение и указанные договоры установленным в них способом, включая использование Приложения, вы принимаете условия настоящей Политики в полном объеме.",
                    private_policy_container_h3: []
                },
                {
                    id_h2: 123324324456,
                    private_policy_h2: "Способы обработки Персональной информации включают любые действия (операции) или комбинацию действий (операций), в том числе, сбор, запись, систематизация, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (предоставление, доступ), обезличивание, блокирование, удаление, уничтожение в установленных настоящей Политикой целях с использованием средств автоматизации или без использования таких средств по усмотрению Goblix",
                    private_policy_container_h3: []
                },
                {
                    id_h2: 1456874545676,
                    private_policy_h2: "Здесь и далее в Политике используются термины и определения, предусмотренные Соглашением, а также иными заключаемыми с Пользователем договорами, если иное не предусмотрено настоящей Политикой или не вытекает из ее существа. В иных случаях толкование применяемого в Политике термина производится в соответствии с применимым законодательством, обычаями делового оборота, или научной доктриной.",
                    private_policy_container_h3: []
                }
            ]
        },
        {
            id_h1: 1123467656,
            private_policy_h1: "Персональная информация",
            private_policy_container_h2: [
                {
                    id_h2: 123164231,
                    private_policy_h2: "Под Персональной информацией в настоящей Политике понимается:",
                    private_policy_container_h3: [
                        {
                            id_h3: 1234312311,
                            private_policy_h3: "Информация, которую Пользователь предоставляет о себе самостоятельно при регистрации или авторизации, а также в процессе дальнейшего использования Приложения и/или Сервиса, включая персональные данные Пользователя."
                        },
                        {
                            id_h3: 123121231,
                            private_policy_h3: "Данные, которые передаются в автоматическом режиме в зависимости от настроек программного обеспечения Пользователя в обезличенном виде."
                        }
                    ]
                },
                {
                    id_h2: 123871231,
                    private_policy_h2: "Goblix вправе устанавливать требования к составу Персональной информации Пользователя, которая должна обязательно предоставляться для использования Приложения и основанного на нем Сервиса. Если определенная информация не помечена Goblix как обязательная, ее предоставление или раскрытие осуществляется Пользователем по своему усмотрению.",
                    private_policy_container_h3: []
                },
                {
                    id_h2: 123125431,
                    private_policy_h2: "При регистрации Пользователем обязательно указываются имя учётной записи (логин), адрес электронной почты и пароль. При регистрации Goblix создает уникальный идентификатор каждого Пользователя (user_id). Идентификатор Пользователя привязан к информации профиля Пользователя.",
                    private_policy_container_h3: []
                },
                {
                    id_h2: 1231234231,
                    private_policy_h2: "Данные, раскрываемые Пользователем неопределенному кругу лиц. С использованием функциональных возможностей Приложения Пользователь может самостоятельно, своими действиями, по своему усмотрению, раскрывать неопределенному кругу лиц (публиковать в Приложении) информацию своего профиля в Приложении, которая может включать персональные данные, в том числе: фамилия, имя, отчество, пол, дата рождения, город местонахождения, место работы, должность, сведения о себе в свободной форме. Добавленная Пользователем в профиль информациюя становится доступной неограниченному кругу лиц, с учетом настроек отображения информации профиля в Сервисе.",
                    private_policy_container_h3: []
                },
                {
                    id_h2: 12312121,
                    private_policy_h2: "Goblix не осуществляет проверку достоверности предоставляемой Персональной информации и наличия у Пользователя необходимого согласия на ее обработку в соответствии с настоящей Политикой, полагая, что Пользователь действует добросовестно, осмотрительно и прилагает все необходимые усилия к поддержанию такой информации в актуальном состоянии и получению всех необходимых согласий субъектов персональных данных.",
                    private_policy_container_h3: []
                },
                {
                    id_h2: 1231231,
                    private_policy_h2: "Goblix не несет ответственность за порядок использования Персональной информации Пользователя третьими лицами, с которыми Пользователь взаимодействует в рамках использования Приложения и/или Сервиса.",
                    private_policy_container_h3: []
                },
            ]
        },
        {
            id_h1: 1123467634356,
            private_policy_h1: "Правовые основания обработки Персональной информации",
            private_policy_container_h2: [
                {
                    id_h2: 12315475231,
                    private_policy_h2: "Правовые основания, на которых Goblix использует Персональную информацию, включают:",
                    private_policy_container_h3: [
                        {
                            id_h3: 123454312311,
                            private_policy_h3: "Обработку Персональной информации, когда Пользователь предоставил согласие на обработку для одной или нескольких конкретных целей;"
                        },
                        {
                            id_h3: 1234379812311,
                            private_policy_h3: "Обработку Персональной информации, когда это необходимо для исполнения договора, стороной которого является Пользователь;"
                        },
                        {
                            id_h3: 12343798512311,
                            private_policy_h3: "Обработку Персональной информации, когда это необходимо для заключения договора с Пользователем;"
                        },
                        {
                            id_h3: 123437981212311,
                            private_policy_h3: "Обработку Персональной информации, которая необходима для исполнения Goblix своих обязательств в соответствии с применимым правом."
                        }
                    ]
                }
            ]
        },
        {
            id_h1: 1111211,
            private_policy_h1: "Хранение Персональной информации",
            private_policy_container_h2: [
                {
                    id_h2: 1111164572,
                    private_policy_h2: "Вся собранная Персональная информация хранится только в течение периода, когда она необходима для достижения целей, в которых такая информация была собрана, или в течение периода, разрешенного или требуемого в соответствии с положениями применимого законодательства. Периодически Goblix проводит проверку систем обработки данных, для определения того, остаются ли действительными цели сбора и обработки персональных данных пользователей. Такое определение основано на ряде факторов, который включает, но не ограничивается следующим: поддерживает ли Пользователь отношения с Goblix, выполнены ли Goblix запросы Пользователя (включая любые дополнительные задания), существуют ли договорные отношения между Пользователем и Goblix, а также существуют ли договорные или законные основания для продолжения хранения персональных данных Пользователя. Основываясь на результатах такой проверки и уведомлениях, полученных от субъектов персональных данных, Goblix обновляет свои системы.",
                    private_policy_container_h3: []
                },
                {
                    id_h2: 123324324456,
                    private_policy_h2: "В целях повышения качества Сервиса и обеспечения возможности правовой защиты, Хабр вправе хранить лог-файлы о действиях, совершенных Пользователем в рамках использования Приложения и/или Сервиса, а также в связи с заключением и исполнением Пользователем Соглашения и иных договоров со своей стороны, в течение 1 (Одного) года с момента их совершения.",
                    private_policy_container_h3: []
                }
            ]
        },
        {
            id_h1: 11112341,
            private_policy_h1: "Требования к защите Персональной информации",
            private_policy_container_h2: [
                {
                    id_h2: 1111164572,
                    private_policy_h2: "Goblix осуществляет хранение Персональной информации и обеспечивает ее охрану от несанкционированного доступа и распространения в соответствии с внутренними правилами и регламентами.",
                    private_policy_container_h3: []
                },
                {
                    id_h2: 123324324456,
                    private_policy_h2: "В отношении Персональной информации Пользователя сохраняется ее конфиденциальность, за исключением информации, раскрытой Пользователем неограниченному кругу лиц (п. 2.4. настоящей Политики), и иных случаев, когда технология Приложения или предоставляемого на его основе Сервиса либо настройки используемого Пользователем программного обеспечения предусматривают открытый обмен информацией с иными Пользователями Приложения или с любыми пользователями сети Интернет.",
                    private_policy_container_h3: []
                }
            ]
        },
        {
            id_h1: 12311211,
            private_policy_h1: "Изменение и удаление Персональной информации",
            private_policy_container_h2: [
                {
                    id_h2: 1111164572,
                    private_policy_h2: "Пользователь вправе в любой момент самостоятельно отредактировать в своем Личном кабинете предоставленную им при регистрации или авторизации Персональную информацию.",
                    private_policy_container_h3: []
                }
            ]
        },
        {
            id_h1: 14315411,
            private_policy_h1: "Передача Персональной информации",
            private_policy_container_h2: [
                {
                    id_h2: 1111164572,
                    private_policy_h2: "Goblix вправе передавать Персональную информацию третьим лицам в следующих случаях:",
                    private_policy_container_h3: [
                        {
                            id_h3: 123454312311,
                            private_policy_h3: "Пользователь выразил свое согласие на такие действия, включая случаи применения Пользователем настроек используемого программного обеспечения, не ограничивающих предоставление определенной информации;"
                        },
                        {
                            id_h3: 1234379812311,
                            private_policy_h3: "Передача необходима в рамках использования Пользователем функциональных возможностей Приложения и/или специфики основанного на нем Сервиса;"
                        },
                        {
                            id_h3: 12343798512311,
                            private_policy_h3: "В связи с передачей Приложения во владение, пользование или собственность такого третьего лица, включая уступку прав по заключенным с Пользователем договорам в пользу такого третьего лица;"
                        },
                        {
                            id_h3: 1234379812121311,
                            private_policy_h3: "По запросу суда или иного уполномоченного государственного органа в рамках установленной законодательством процедуры;"
                        },
                        {
                            id_h3: 1234379812512311,
                            private_policy_h3: "Для защиты прав и законных интересов Goblix в связи с нарушением заключенных с Пользователем договоров."
                        }
                    ]
                }
            ]
        }
    ];

    return (
        <section className="privacy-policy-section section">
            <div className="privacy-policy-container container">
                <div className="codex-box">
                    <div className="codex-container">
                        <h1 className="privacy-policy__title">{private_policy_section_data.private_policy_page_title}</h1>
                        <p className="codex-box__text">{private_policy_section_data.private_policy_page_text}</p>
                    </div>
                    <div className="codex-box__img">
                        <img src={logo} alt="" className="full-img" />
                    </div>
                </div>
                <ol className="privacy-policy__list-1">
                    {private_policy_section_data_js.map((private_policy) => (
                        <li key={private_policy.id_h1} className="privacy-policy__list-1__title">{private_policy.private_policy_h1}
                            <ol className="privacy-policy__list-2">
                                {private_policy.private_policy_container_h2.map((private_policy_2) => (
                                    <li key={private_policy_2.id_h2} className="privacy-policy__list-2__title">{private_policy_2.private_policy_h2}
                                        <ol className="privacy-policy__list-3">
                                            {private_policy_2.private_policy_container_h3.map((private_policy_3) => (
                                                <li key={private_policy_3.id_h3} className="privacy-policy__list-3__title">{private_policy_3.private_policy_h3}</li>
                                            ))}
                                        </ol>
                                    </li>
                                ))}
                            </ol>
                        </li>
                    ))}
                </ol>
            </div>
        </section>
    );
}